# CircuitsOverlapDisconnectCircuits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..CircuitsOverlapDisconnectCircuits Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
More than one circuit falls onto the same slot. These circuits will be disconnected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircuitsOverlapDisconnectCircuits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircuitsOverlapDisconnectCircuits As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircuitsOverlapDisconnectCircuits {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace